[A_Reinforcements_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipUpgraded=""
mName="天降援军"
mTooltip="战斗开始时，友方生物的数量增加 %buff.buff.special1。以此方式添加的生物在战斗后不会保留在军队中。"

[A_Reinforcements_Buff H7BaseBuff]
mName="天降援军"
mTooltip="天降援军"

[A_Patriot_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="护国志士"
mTooltip="总督：此城镇控制区内的所有友方英雄获得 %buff1.buff.stat %buff1.buff.stat.icon 领导力。"

[A_Patriot_Buff H7BaseBuff]
mName="护国志士"
mTooltip="此控制区内 %stat %stat.icon 领导力"

[A_LeadingByExample_Buff H7BaseBuff]
mName="身先士卒"
mTooltip=""

[A_Resolution_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="百折不挠"
mTooltip="友方生物的士气不能低于5。"

[A_Resolution_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_Outnumbering_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="多多益善"
mTooltip="英雄可以部署最多 %stat.norm 个生物队伍。"

[A_AdvancedTactics_Ability H7HeroAbility]
mName="高级战术"
mTooltip="英雄可以在战术阶段部署9个独立的生物队伍。"
[A_Ambush_Ability H7HeroAbility]
mName="埋伏"
mTooltip="英雄军队中生物的主动性和士气在前三回合各提高5点。"
[A_Ambush_Buff H7BaseBuff]
mName="埋伏"
mTooltip="士气和主动性提高5点。"
[A_DesignateTarget_Ability H7HeroAbility]
mName="目标锁定"
mTooltip="如果英雄攻击一个敌方生物，你所有的生物在该战斗回合攻击此生物时获得+5攻击。"
[A_DesignateTarget_Buff H7BaseBuff]
mName="目标锁定增益"
mTooltip="攻击值提高5点"
[A_DesignateTarget_Buff_Marker H7BaseBuff]
mName="目标锁定标记"
mTooltip="该生物在当前战斗回合剩余时间内被标记。所有攻击的生物将获得+5攻击。"
[A_HomeFlag_Ability H7HeroAbility]
mName="家园旗帜"
mTooltip="总督：城镇控制区内的所有友方英雄获得+5领导力。"
[A_HomeFlag_Buff H7BaseBuff]
mName="家园旗帜"
mTooltip="领导力提高5点。"
[A_PepTalk_Ability H7HeroAbility]
mName="鼓舞演说"
mTooltip="当一个友方生物因其士气低落而无法在其回合行动时，它会获得半个回合。"
[A_PepTalk_Buff_Marker H7BaseBuff]
mName="鼓舞演说"
[A_Resolution_Buff_Marker H7BaseBuff]
mName="百折不挠"

UCP 1.2

[A_LeadingByExample_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="身先士卒"
mTooltip="英雄攻击一个敌方生物后，所有友方生物在该战斗回合近战攻击同一生物时获得 %buff.buff.special.val1 %ICON_ATTACK 攻击。"

[A_LeadingByExample_Buff_Marker H7BaseBuff]
mName="身先士卒"
mTooltip="敌方生物近战攻击该生物时获得 %special.val1 %ICON_ATTACK 攻击。持续到战斗回合结束。"

[A_Tactics_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="排兵布阵"
mTooltip="英雄可以在前 %stat1.norm 排部署生物。"

v1.38

[A_RousingSpeech_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="振奋演说"
mTooltip="在前 %buff.buff.durini 战斗回合内，友方生物获得 %buff.buff.stat1 %buff.buff.stat1.icon 士气和 %buff.buff.stat2 %buff.buff.stat2.icon 生命值。"

[A_RousingSpeech_Buff H7BaseBuff]
mName="振奋演说"
mTooltip="%stat1 %stat1.icon 士气\n%stat2 %stat2.icon 生命值。\n仍持续 %durnow 回合。"

v1.41

[A_Leadership_Skill H7Skill]
mName="领导"
mTooltip="领导技能工具提示"
mDescriptions[0]="提高英雄的领导力。"
mDescriptions[1]=""
mDescriptions[2]="英雄的领导力提高 %stat1.norm %stat1.icon。"
mDescriptions[3]="英雄的领导力额外提高 %stat1.norm %stat1.icon。"
mDescriptions[4]="英雄的领导力额外提高 %stat1.norm %stat1.icon。\n\n与大师级<font color="#00588BFF">光系魔法</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：闪耀士气。"